In [1]:
import numpy as np
import pandas as pd

In [5]:
dict1 = {
    "name":['harry','rohan','mayur','ram'],
    "marks":[92,34,24,17],
    "city":['rampur','anklav','ashodar','jamnagar']}

In [6]:
pd.DataFrame(dict1)

    name  marks      city
0  harry     92    rampur
1  rohan     34    anklav
2  mayur     24   ashodar
3    ram     17  jamnagar

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

    name  marks      city
0  harry     92    rampur
1  rohan     34    anklav
2  mayur     24   ashodar
3    ram     17  jamnagar

In [9]:
df.to_csv('friends.csv')

In [11]:
df.to_csv('friends_index_false_csv',index=False)

In [12]:
df.head(2)

    name  marks    city
0  harry     92  rampur
1  rohan     34  anklav

In [13]:
df.tail(2)

    name  marks      city
2  mayur     24   ashodar
3    ram     17  jamnagar

In [14]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000